# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'facebook/fb'
tap 'getsentry/tools'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'circleci'
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'facebook/fb/idb-companion', link: false
brew 'ffmpeg'
brew 'getsentry/tools/sentry-cli'
brew 'git'
brew 'gitlab-runner'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pre-commit'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'thefuck'
brew 'tree' # List directories in a tree structure
brew 'watchman'
brew 'wget'
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php', restart_service: true
brew 'php@7.3'
brew 'php@7.2'
brew 'pipenv'
brew 'cocoapods', link: false
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql', restart_service: true
brew 'nginx', restart_service: true
brew 'node'
brew 'nvm'
brew 'redis'
brew 'yarn'

# Apps
cask '1password-cli'
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'android-studio'
cask 'authy'
cask 'bartender'
cask 'bunch'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'fork'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'lastpass'
cask 'ngrok'
cask 'pdf-expert'
cask 'react-native-debugger'
cask 'rescuetime'
cask 'selfcontrol'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelblick'
cask 'viber'
cask 'visual-studio-code'
cask 'vlc'
cask 'windscribe'
cask 'wkhtmltopdf'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
# cask 'font-open-sans'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas "1Blocker", id: 1107421413
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Bear", id: 1091189122
mas "Chronicle Pro", id: 1280542517
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Hour Blocks", id: 1456275153
mas "JPEGmini Lite", id: 525742250
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Powerpoint", id: 462062816
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835